---
kind: method
id: M:Autodesk.Revit.DB.RevisionNumberingSequence.HasValidAlphanumericRevisionSettings
source: html/4dd5b623-eac0-0940-cf51-8e4cd6d7dc9f.htm
---
# Autodesk.Revit.DB.RevisionNumberingSequence.HasValidAlphanumericRevisionSettings Method

Checks whether the revision numbering sequence owns a valid alphanumeric revision settings.

## Syntax (C#)
```csharp
public bool HasValidAlphanumericRevisionSettings()
```

## Returns
True if the revision numbering sequence owns a valid alphanumeric revision settings.